package src;

public enum IdentityDocumentType {
    /**
     * Паспорт гражданина РФ
     */
    PASSPORT,
    /**
     * Свидетельство о рождении гражданина
     */
    BIRTH_CERTIFICATE,
    /**
     * Общегражданский заграничный паспорт
     */
    INTERNATIONAL_PASSPORT,
    /**
     * Паспорт моряка
     */
    SEAMAN_PASSPORT,
    /**
     * удостоверение личности военнослужащего или военный билет
     */
    MILITARY_CARD,
    /**
     * временное удостоверение личности гражданина Российской Федерации,
     * выдаваемое органом внутренних дел до оформления паспорта
     */
    TEMPORARY_IDENTITY_CARD,
    /**
     * СНИЛС
     */
    SNILS
}
